packages/uqtopus/uqtopus-0.1.0.tar.gz/uqtopus-0.1.0/examples/templates/offsetCylinder/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar;

laminar
{
    model        generalisedNewtonian;

    viscosityModel CrossPowerLaw;

    nuInf           {{nuInf}};/* infinite shear viscosity */
    m               {{m}};    /* transition between Newtonian / Non */
    n               {{n}};    /* shear-dependent behavior */
}

// ************************************************************************* //
